{
  "irVersion": 1,
  "schemaVersion": 1,
  "schemaVersions": [
    {
      "version": 1,
      "migrations": [
        "0001_initial"
      ]
    }
  ],
  "tables": [
    {
      "name": "todos",
      "primaryKey": "id",
      "columns": [
        {
          "name": "id",
          "type": "string",
          "nullable": false
        },
        {
          "name": "list_id",
          "type": "string",
          "nullable": false
        },
        {
          "name": "title",
          "type": "string",
          "nullable": false
        },
        {
          "name": "done",
          "type": "boolean",
          "nullable": false
        },
        {
          "name": "position",
          "type": "integer",
          "nullable": false
        },
        {
          "name": "updated_at_ms",
          "type": "integer",
          "nullable": false
        },
        {
          "name": "attachment",
          "type": "blob_ref",
          "nullable": true
        }
      ],
      "scopes": [
        {
          "pattern": "list:{list_id}",
          "variable": "list_id",
          "column": "list_id"
        }
      ],
      "extensions": {}
    }
  ],
  "subscriptions": [
    {
      "name": "todoList",
      "table": "todos",
      "scopes": [
        {
          "variable": "list_id",
          "values": [
            {
              "kind": "parameter",
              "name": "listId"
            }
          ]
        }
      ]
    }
  ],
  "extensions": {}
}
